---
title: RoomFailures
classe: Autodesk.Revit.DB.BuiltInFailures+RoomFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 48
---

# RoomFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AreaTagBadViewType { get; }` | `RoomFailures.AreaTagBadViewType` | FailureDefinitionId |
| `FailureDefinitionId AreaUnplaceWarning { get; }` | `RoomFailures.AreaUnplaceWarning` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeRoomsGeometry { get; }` | `RoomFailures.CannotMakeRoomsGeometry` | FailureDefinitionId |
| `FailureDefinitionId ExtensionsOverlapWarning { get; }` | `RoomFailures.ExtensionsOverlapWarning` | FailureDefinitionId |
| `FailureDefinitionId InvalidReflectivityPercentage { get; }` | `RoomFailures.InvalidReflectivityPercentage` | FailureDefinitionId |
| `FailureDefinitionId InvisibleRoomBoundElemement { get; }` | `RoomFailures.InvisibleRoomBoundElemement` | FailureDefinitionId |
| `FailureDefinitionId LoadareaRecovered { get; }` | `RoomFailures.LoadareaRecovered` | FailureDefinitionId |
| `FailureDefinitionId NoReferenceRecenteredWarning { get; }` | `RoomFailures.NoReferenceRecenteredWarning` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictBoundariesVaryMainAddToOptionSet { get; }` | `RoomFailures.OptionConflictBoundariesVaryMainAddToOptionSet` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictBoundariesVaryMainSeparate { get; }` | `RoomFailures.OptionConflictBoundariesVaryMainSeparate` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictBoundariesVaryOptionSeparate { get; }` | `RoomFailures.OptionConflictBoundariesVaryOptionSeparate` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictInLinkBoundariesVaryMainAddToOptionSet { get; }` | `RoomFailures.OptionConflictInLinkBoundariesVaryMainAddToOptionSet` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictInLinkBoundariesVaryMainSeparate { get; }` | `RoomFailures.OptionConflictInLinkBoundariesVaryMainSeparate` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictInLinkBoundariesVaryOptionSeparate { get; }` | `RoomFailures.OptionConflictInLinkBoundariesVaryOptionSeparate` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictInLinkRoomOverlapMain { get; }` | `RoomFailures.OptionConflictInLinkRoomOverlapMain` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictInLinkRoomOverlapOption { get; }` | `RoomFailures.OptionConflictInLinkRoomOverlapOption` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictRoomOverlapMain { get; }` | `RoomFailures.OptionConflictRoomOverlapMain` | FailureDefinitionId |
| `FailureDefinitionId OptionConflictRoomOverlapOption { get; }` | `RoomFailures.OptionConflictRoomOverlapOption` | FailureDefinitionId |
| `FailureDefinitionId RoomBaseAboveComputationHeight { get; }` | `RoomFailures.RoomBaseAboveComputationHeight` | FailureDefinitionId |
| `FailureDefinitionId RoomBelowCompHeight { get; }` | `RoomFailures.RoomBelowCompHeight` | FailureDefinitionId |
| `FailureDefinitionId RoomBoundaryMisalignment { get; }` | `RoomFailures.RoomBoundaryMisalignment` | FailureDefinitionId |
| `FailureDefinitionId RoomHeightNegative { get; }` | `RoomFailures.RoomHeightNegative` | FailureDefinitionId |
| `FailureDefinitionId RoomLevelElevs { get; }` | `RoomFailures.RoomLevelElevs` | FailureDefinitionId |
| `FailureDefinitionId RoomNotEnclosed { get; }` | `RoomFailures.RoomNotEnclosed` | FailureDefinitionId |
| `FailureDefinitionId RoomNotEnclosedAreas { get; }` | `RoomFailures.RoomNotEnclosedAreas` | FailureDefinitionId |
| `FailureDefinitionId RoomNotEnclosedLoadAreas { get; }` | `RoomFailures.RoomNotEnclosedLoadAreas` | FailureDefinitionId |
| `FailureDefinitionId RoomNotEnclosedRooms { get; }` | `RoomFailures.RoomNotEnclosedRooms` | FailureDefinitionId |
| `FailureDefinitionId RoomNotEnclosedSpaces { get; }` | `RoomFailures.RoomNotEnclosedSpaces` | FailureDefinitionId |
| `FailureDefinitionId RoomsCreatedAutomatically { get; }` | `RoomFailures.RoomsCreatedAutomatically` | FailureDefinitionId |
| `FailureDefinitionId RoomsFailed { get; }` | `RoomFailures.RoomsFailed` | FailureDefinitionId |
| `FailureDefinitionId RoomsInSameRegion { get; }` | `RoomFailures.RoomsInSameRegion` | FailureDefinitionId |
| `FailureDefinitionId RoomsInSameRegionAreas { get; }` | `RoomFailures.RoomsInSameRegionAreas` | FailureDefinitionId |
| `FailureDefinitionId RoomsInSameRegionLoadAreas { get; }` | `RoomFailures.RoomsInSameRegionLoadAreas` | FailureDefinitionId |
| `FailureDefinitionId RoomsInSameRegionRooms { get; }` | `RoomFailures.RoomsInSameRegionRooms` | FailureDefinitionId |
| `FailureDefinitionId RoomsInSameRegionSpaces { get; }` | `RoomFailures.RoomsInSameRegionSpaces` | FailureDefinitionId |
| `FailureDefinitionId RoomsOverlapInHeight { get; }` | `RoomFailures.RoomsOverlapInHeight` | FailureDefinitionId |
| `FailureDefinitionId RoomsReallyFailed { get; }` | `RoomFailures.RoomsReallyFailed` | FailureDefinitionId |
| `FailureDefinitionId RoomTagBadViewType { get; }` | `RoomFailures.RoomTagBadViewType` | FailureDefinitionId |
| `FailureDefinitionId RoomTagDeleted { get; }` | `RoomFailures.RoomTagDeleted` | FailureDefinitionId |
| `FailureDefinitionId RoomTagNotInRoom { get; }` | `RoomFailures.RoomTagNotInRoom` | FailureDefinitionId |
| `FailureDefinitionId RoomTagNotInRoomToArea { get; }` | `RoomFailures.RoomTagNotInRoomToArea` | FailureDefinitionId |
| `FailureDefinitionId RoomTagNotInRoomToRoom { get; }` | `RoomFailures.RoomTagNotInRoomToRoom` | FailureDefinitionId |
| `FailureDefinitionId RoomTagNotInRoomToSpace { get; }` | `RoomFailures.RoomTagNotInRoomToSpace` | FailureDefinitionId |
| `FailureDefinitionId RoomTagVolumeNotComputed { get; }` | `RoomFailures.RoomTagVolumeNotComputed` | FailureDefinitionId |
| `FailureDefinitionId RoomTooShort { get; }` | `RoomFailures.RoomTooShort` | FailureDefinitionId |
| `FailureDefinitionId RoomUnplaceWarning { get; }` | `RoomFailures.RoomUnplaceWarning` | FailureDefinitionId |
| `FailureDefinitionId ShowRoomBoundingElements { get; }` | `RoomFailures.ShowRoomBoundingElements` | FailureDefinitionId |
| `FailureDefinitionId SpaceUnplaceWarning { get; }` | `RoomFailures.SpaceUnplaceWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```